 data =   [{
            "id": 5,
            "name": "Сбербанк",
            "town": "Москва",
            "site": "sberbank.ru",
            "position": "Analyst - Data Engineer",
            "begin": "01.2021",
            "end": "Present",
            "delta": "11 месяцев",
            "results": {
                "responcibilities": [
                    "Сбор и документирование функциональных требований",
                    "Составление постпроектной документации",
                    "Описание бизнес-процессов",
                    "Описание внутренних сервисов",
                    "Формирование требований для доработок смежным командам"
                    "",
                    "Создание скриптов классификации встреч",
                    "Создание скриптов расчета статистики тайм-менеджмента по топ-2000"
                ],
                "archievements": [
                    "Ворвался в уютный мир дата-аналитиков и принес git, логи, тесты, конфиги и прочие инфраструктурные улучшения",
                    "Оптимизировал код, что уменьшило время выполнения в >20 раз",
                    "Разрабатывал скрипты, которые считали ежеквартальную статистику по управлению временем руководства банка для президента банка."
                ],
                "projects": [
                    "Развитие продукта Умный календарь",
                    "Статистика Тайм-менеджмента руководства ПАО Сбербанк"
                ]
            },
            "free_description": ""
        }, {
            "id": 4,
            "name": "Сбербанк",
            "town": "Москва",
            "site": "sberbank.ru",
            "position": "Analyst",
            "begin": "01.2020",
            "end": "12.2020",
            "delta": "11 месяцев",
            "results": {
                "responcibilities": [
                    "Сбор и документирование функциональных требований",
                    "Составление постпроектной документации",
                    "Описание бизнес-процессов",
                    "Описание внутренних сервисов",
                    "Формирование требований для доработок смежным командам"
                ],
                "projects": [
                    "Поддержка процесса заказа дебетовой карты на сайте sberbank.ru",
                    "Миграция карточных продуктов на новый процессинг",
                    "Заказ дебетовой карты в неклиентской зоне",
                    "Счет 40914 в неклиентской зоне",
                    "Интеграция карточного продукта Яндекс.Деньги в неклиентскую зону",
                    "Миграция подсистемы заказа дебетовой карты на сайте на новую версию платформы"
                ]
            },
            "free_description": "Много работал над неклиентской зоной Сбербанк Онлайн, которая легла в ящик."
        }, {
            "id": 3,
            "name": "InPlat",
            "town": "Москва",
            "site": "inplat.ru",
            "position": "Analyst",
            "begin": "11.2017",
            "end": "12.2019",
            "delta": "2 года 2 месяца",
            "results": {
                "responcibilities": [
                    "Сбор и документирование функциональных требований",
                    "Составление постпроектной документации",
                    "Описание бизнес-процессов",
                    "Описание внутренних сервисов",
                    "Ведение протоколов обмена данными с клиентами"
                ],
                "archievements": [
                    "Создал единую систему документации на базе Sphinx (мое личное достижение и гордость)."
                ],
                "projects": [
                    "Кредитный процессинг Мегафон 2.0",
                    "Мобильный эквайринг Мегафон",
                    "Мобильный эквайринг Теле2",
                    "Автоплатежи Мегафон",
                    "Перевод витрины money.megafon.ru под контроль InPlat",
                    "Переводы Мегафон Россия - Мегафон Таджикистан",
                    "Фискализация эквайринговых партнеров InPlat",
                    "Фискализация Мегафон, Yota, NetByNet",
                    "SMS бот 007, 500 в Мегафон",
                    "Страхование Мегафон Ритейл",
                    "Страховые планы 'Болей выгодно', 'Наши дети' для HomeCredit Insurance",
                    "",
                    "Создание платформы Самозанятых для всех сотрудников Mail.ru Group",
                    "Упрощенная продажа SIM-карт Мегафон к чемпионату Европы",
                    "Эквайринг по свободным реквизитам",
                    "Модуль МСФО9 для банка Раунд",
                    "Создание счетов 40914 для абонентов Мегафон",
                    "Услуга 'Потряси-Переведи'"
                ]
            },
            "free_description": "Как правило я подключался к проекту на стадии подготовки кейсов и ограничений. Собранные требования после обработки превращалось мной в ТЗ, которое передавалось в разработку. В процессе разработки консультировал разработчиков, обновлял описание, ибо всегда появляются новые вводные). После разработки оформлял постпроектную документацию, в которую входило описание сервиса внутри (схемы, выгрузки, смежные сервисы, иногда описание БД и конфигов) и снаружи (протоколы, контакты при поломке). В постпроектной документации чаще всего инструкции пользователей делал не я, хотя иногда тоже приходилось."
        },
        {
            "id": 2,
            "name": "InPlat",
            "town": "Москва",
            "site": "inplat.ru",
            "position": "Junior Analyst",
            "begin": "09.2016",
            "end": "11.2017",
            "delta": "1 год 3 месяца",
            "results": {
                "responcibilities": [
                    "Сбор и документирование функциональных требований",
                    "Составление постпроектной документации",
                    "Описание бизнес-процессов",
                    "Описание внутренних сервисов"
                ],
                "archievements": [
                    "Описал 90% технического долга компании",
                    "Инвентаризировал внутреннюю базу сервисов"
                ],
                "projects": [
                    "Кредитный процессинг Мегафон",
                    "Эквайринг Yota",
                    "Интеграция Мегафон и ApplePay",
                    "Интеграция Мегафон и GooglePay",
                    "Интеграция Эквайринга InPlat в платформу InSales"
                ]
            },
            "free_description": ""
        },
        {
            "id": 1,
            "name": "Catzwolf",
            "town": "Москва",
            "site": "catzwolf.ru",
            "position": "Junior IT Consultant",
            "begin": "01.2015",
            "end": "01.2016",
            "delta": "1 год 1 месяц",
            "results": {
                "responcibilities": [
                    "Администрирование рабочих мест сотрудников",
                    "Развертывание и администрирование сетей"
                ]
            },
            "free_description": "Работа эникейщиком"
        }]

z = ""
for _ in data:
    z+= f"""
    <li>
        <span></span>
        <h2 class="title">{_["name"]}</h2>
        <h3>{_["position"]}</h3>
        <h4>Обязанности</h4>
        <div class="responcibilities">
        <dl>
        {"".join(["<dd>"+ x +"</dd>" for x in _["results"]["responcibilities"]])}
        </dl>
        </div>
        <h4>Достижения</h4>
        <div class="archievements">
        <dl>
        {"".join(["<dd>"+ x +"</dd>" for x in _["results"].get("archievements","")])}
        </dl>
        </div>
        <h4>Проекты</h4>
        <div class="projects">
        <dl>
        {"".join(["<dd>"+ x +"</dd>" for x in _["results"].get("projects","")])}
        </dl>
        </div>
        <div class="projects">{_["free_description"]}</div>
        <div class="time">
                <span>{_["end"]}</span>
                <span>{_["begin"]}</span>
        </div>
    </li>
    """
    z = z.replace("\n", "")